wrong_form = ['ا','آ','أ','إ','ﺎ','ﺄ','ﺍ','ﺁ','ٲ','ب','ﺑ','ﺒ','ﺐ','ﺏ','پ','ﭙ'
             ,'ﭘ','ﭗ','ت','ﺗ','ﺖ','ﺘ','ﺕ','ٹ','ث','ث','ﺛ','ج','ﺟ','ﺠ','ﺞ','چ','ﭽ','ﭽ'
             ,'ح','ﺣ','ﺤ','خ','ﺧ','ﺨ','ﺦ','د','ﺪ','ﺩ','ذ','ﺬ','ر','ﺮ','ﺭ','ز','ﺰ','ﺯ'
             ,'ژ','ﮋ','س','ﺴ','ﺳ','ﺲ','ﺱ','ش','ﺸ','ﺷ','ﺶ','ﺵ','ص','ﺼ','ﺻ','ﺹ','ض','ﻀ'
             ,'ﺿ','ﺽ','ط','ﻃ','ﻂ','ﻄ','ٹ','ظ','ﻈ','ع','ﻌ','ﻉ','ﻊ','غ','ﻏ','ﻐ','ف','ﻓ'
             ,'ﻔ','ﻑ','ﻒ','ق','ﻗ','ﻖ','ﻘ','ک','ك','ﻛ','ﻜ','ﻚ','ﮐ','ﮏ','ﮑ','گ','ﮕ','ﮔ'
             ,'ﮓ','ﮒ','ل','ﻟ','ﻠ','ﻞ','ﻝ','م','ﻣ','ﻢ','ﻤ','ﻡ','ن','ﻧ','ﻨ','ﻦ','ﻥ'
             ,'و','ؤ','ﻮ','ﻭ','ۆ','ه','ۀ','ە','ﻫ','ﻪ','ﻬ','ہ','ھ','ﻩ','ﺓ','ی','ئ','ﺋ'
             ,'ي','ﻲ','ﻳ','ﻴ','ﯿ','ﯾ','ﻰ','ﻱ','ﺌ','ﯽ','ے','ﯼ','ﻻ','ﻼ','ﷲ',' ', 'آ']

correct_form = ['ا','ا','ا','ا','ا','ا','ا','ا','ا','ب','ب','ب','ب','ب','پ','پ','پ'
               ,'پ','ت','ت','ت','ت','ت','ت','ث','ث','ث','ج','ج','ج','ج','چ','چ'
               ,'چ','ح','ح','ح','خ','خ','خ','خ','د','د','د','ذ','ذ','ر','ر','ر','ز','ز','ز'
               ,'ژ','ژ','س','س','س','س','س','ش','ش','ش','ش','ش','ص','ص','ص','ص','ض'
               ,'ض','ض','ض','ط','ط','ط','ط','ط','ظ','ظ','ع','ع','ع','ع','غ','غ','غ'
               ,'ف','ف','ف','ف','ف','ق','ق','ق','ق','ک','ک','ک','ک','ک','ک','ک','ک'
               ,'گ','گ','گ','گ','گ','ل','ل','ل','ل','ل','م','م','م','م','م','ن','ن'
               ,'ن','ن','ن','و','و','و','و','و','ه','ه','ه','ه','ه','ه','ه','ه','ه'
               ,'ه','ی','ی','ی','ی','ی','ی','ی','ی','ی','ی','ی','ی','ی','ی','ی'
               ,'لا','لا','لله',' ', 'ا']

def create_correct_mapping():
    correct_mapping = {}
    for i in range(len(wrong_form)):
        correct_mapping[wrong_form[i]] = correct_form[i]
    correct_mapping[' '] = ' '
    correct_mapping['\n'] = ' '
    return correct_mapping
